{
  "add_prefix_space": false,
  "added_tokens_decoder": {
    "50256": {
      "content": "<|endoftext|>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "bos_token": "<|endoftext|>",
  "chat_template": "{% for message in messages %}\n            {% if message['role'] == 'user' %}\n                User: {{ message['content'] }}\n            {% elif message['role'] == 'assistant' %}\n                Assistant: {{ message['content'] }}\n            {% elif message['role'] == 'system' %}\n                System: {{ message['content'] }}\n            {% endif %}\n        {% endfor %}",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|endoftext|>",
  "errors": "replace",
  "extra_special_tokens": {},
  "model_max_length": 1024,
  "pad_token": "<|endoftext|>",
  "padding_side": "right",
  "tokenizer_class": "GPT2Tokenizer",
  "truncation_side": "right",
  "unk_token": "<|endoftext|>"
}
